ba-server/app/controllers/flights_controller.rb

INSERT INTO "flights" ("flight_no", "origin", "destination", "date", "airplane_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

UPDATE "flights" SET "airplane_id" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["airplane_id", 20], ["updated_at", "2018-02-07 10:59:17.523809"], ["id", 23]]
---
  def update
    respond_to do |format|
      if @flight.update(flight_params)