ba-server/app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("seat_row", "seat_column", "user_id", "flight_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["seat_row", 12], ["seat_column", "A"], ["user_id", 2], ["flight_id", 1], ["created_at", "2018-02-06 04:37:38.557969"], ["updated_at", "2018-02-06 04:37:38.557969"]]