ba-server/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "is_admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sahana"], ["email", "sahana@test.com"], ["password", "saanvi"], ["is_admin", "f"], ["created_at", "2018-02-06 04:36:09.975886"], ["updated_at", "2018-02-06 04:36:09.975886"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save